{"text": "Vamshi Nagireddy\n+1 (916) 707-2957 ⋄vamshi.knagireddy@gmail.com ⋄linkedin.com/in/vamshinr ⋄San Jose, CA\nSUMMARY\n• machine learning Engineer with extensive experience at Intel, designing benchmarking framework and driving Optimization of\nGenAI/non-AI workloads using Python and C++, leading to performance gains across Intel’s hardware portfolio. • Proven track record in improving the accuracy of resume parsing tool by 10% through optimizing advanced sequence models. • Skilled in building job recommendation engines and integrating Elasticsearch for enhanced job matching and ranking, and\ndeploying robust data pipelines with Kafka and MLFlow.", "start": 0, "end": 645}
{"text": "• Strong foundation in Python programming, deep learning models, and scalable architectures. • Delivered robust solutions for automation across platforms playing a key role in UI development for benchmark applications. • Proven expertise in MLOps, cloud technologies, and cross-functional collaboration to deliver scalable, data-driven solutions with\nmeasurable business impact. SKILLS\n• Programming Languages - Python, C, C++, Java, Shell Scripting. • Web Development - HTML/CSS, JavaScript, Angular, React, Flask, Django, FastAPI, windows, Linux, Macos.", "start": 595, "end": 1150}
{"text": "• Machine Learning And AI - TensorFlow, PyTorch, scikit-learn, Pandas, NumPy, ONNX. • DevOps And Cloud Technologies - Docker, Kubernetes, Jenkins, Git, Kafka, MLFlow. • Data Analytics And Visualization - Tableau, SQL, NoSQL (MongoDB, Neo4j, DynamoDB, Cassandra). • Build And Automation Tools - CMake, Shell Scripting. EXPERIENCE\nSoftware Engineer — Intel Corporation — San Jose, CA\nJuly 2023 - Present\n• Developed AI/non-AI workloads using Python and C++ for various consortiums to develop benchmarks and industry standards\ncontributing to performance gains across intel’s hardware platforms, including CPUs, GPUs, and NPUs.", "start": 1100, "end": 1724}
{"text": "• Architected and Implemented event driven state machine framework in Python for automating workloads across various\nplatforms contributing extensively to Python multi-threading to manage concurrent processes (battery logging, running\nworkloads) along with building a HWINFO parser tool to identify and address optimization areas. • Contributed to Creating a cross-platform security and installer tool in C++ by manipulating SQL database and employ-\ning CMake for build automation. Collaborated cross-functionally with research scientists, hardware engineers, and software\ndevelopers to align AI workload strategies with Intel’s product roadmap.", "start": 1674, "end": 2319}
{"text": "• Evaluated Generative AI approaches in LLM inferencing for system integration, emphasizing limitations and advantages. • Experimented with various RAG pipelines, prompt engineering, model quantization, and fine-tuning to optimize per-\nformance and adaptability contributing to Optimization of Intel’s AI software stack (OpenVINO) for LLM inferencing. Machine Learning Intern — Intel Corporation — San Jose, CA\nMay 2022 - August 2022\n• Conducted inference optimization using ONNX Runtime and OpenVINO for SPEC benchmarks.", "start": 2269, "end": 2790}
{"text": "• Developed and optimized ML workloads using AVX512 instructions and hardware accelerators, including face recognition. Built a performance parser to compare workload efficiencies across platforms\nGraduate Research Assistant — CSUS — Sacramento, CA\nJanuary 2022 - May 2023\n• Developed data scraping solutions and performed data analysis on SEC filings using Python. Machine Learning Engineer — Phenom — Ambler, PA\nJuly 2019 - July 2021\n• Spearheaded the Design and optimization of sequence models, including RNNs, CNNs, LSTMs, and Transformers, to\nimprove Named Entity Recognition (NER) and text classification for a resume parsing tool, achieving a 10% accuracy increase.", "start": 2740, "end": 3412}
{"text": "• Developed job recommendation engine with Elasticsearch DB integration to improve job matching and ranking algorithms. • Designed a BERT based sequence classifier for distinguishing various sections of a resume along with extracting raw text from\nunstructured data Building a data pipeline integrating parsed log data with Kafka and visualized insights using ELK Kibana. • Utilized MLFlow for model training, Monitor the performance of deployed models, maintain, and update as necessary. PROJECTS\n• Job Recommendation Engine With NEO4J, MongoDB, DYNAMODB, CASSANDRA.", "start": 3362, "end": 3929}
{"text": "Conducted a comprehensive\nstudy on NoSQL databases to evaluate their performance for job recommendation use cases. Generated insights into trade-offs\nbetween query execution times, replication strategies, consistency, availability, and performance in distributed NoSQL systems\nproposing recommendations for database selection based on application-specific performance requirements. (Weblink)\n• Human Activity Recognition Using Attention. Implemented an attention-based BiLSTM-CNN ensemble algorithm to\nidentify human gestures for monitoring health by Preprocessing raw CSI data captured from accelerometer, gyroscopes.", "start": 3879, "end": 4497}
{"text": "(Github)\n• NLP on News Articles. Extracted thousands of news articles through web scraping with bs4. Performed extensive data\ncleaning, exploratory data analysis on news articles data. Conducted text summarization with Spacy, text complexity analysis,\nand sentiment analysis. (Github)\nEDUCATION\nMaster of Computer Science, California State University Sacramento\n2021 - 2023\nRelevant Coursework: DS Algorithms, Machine Learning/NLP, Distributed Systems, Computer Vision; 3.7 GPA", "start": 4447, "end": 4924}
